wsf_c/savanc/src/subs_mgrs/registry/test/ab/esb_subscribe.xml

<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing"><wsa:To>http://localhost:8281/services/SampleEventSource</wsa:To><wsa:MessageID>urn:uuid:3DFC5D2481ADDB55751236674836804</wsa:MessageID><wsa:Action>http://schemas.xmlsoap.org/ws/2004/08/eventing/Subscribe</wsa:Action></soapenv:Header><soapenv:Body><wse:Subscribe xmlns:wse="http://schemas.xmlsoap.org/ws/2004/08/eventing"><wse:Delivery Mode="http://schemas.xmlsoap.org/ws/2004/08/eventing/DeliveryModes/Push"><wse:NotifyTo><wsa:Address xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing">http://localhost:9000/services/SimpleStockQuoteService</wsa:Address></wse:NotifyTo></wse:Delivery><wse:Filter Dialect="http://synapse.apache.org/eventing/dialect/topicFilter">weather</wse:Filter></wse:Subscribe></soapenv:Body></soapenv:Envelope>
